Repository: abh4265/portfolio-activity
Catalog: po/yo.po
Languages: yo

source: Portfolio
yo: Apo owo

source: create a slide show from Sugar Journal entries that have been 'starred'
yo: ṣẹda ifaworanhan lati Sugar Journal titẹ sii ti ti ti 'oṣere'

source: 2 seconds
yo: meji aaya

source: 10 seconds
yo: mẹwa aaya

source: 30 seconds
yo: ọgbọn aaya

source: 1 minute
yo: ẹyọkan iseju

source: Enter comments here.
yo: Tẹ comments nibi.

source: Adjust
yo: Satunṣe

source: Fullscreen
yo: Gbogbo sikirini

source: Autoplay
yo: Àdáseeré

source: Adjust playback speed
yo: Satunṣe sẹhin iyara

source: Refresh
yo: Sọ

source: Slide view
yo: Ifaworanhan wo

source: Thumbnail view
yo: Eekanna wo

source: Save as PDF
yo: Fi bi šee iwe kika

source: Do you have any items in your Journal starred?
yo: Ṣe o ni eyikeyi awọn ohun kan ninu rẹ Akosile oṣere?

source: This project is about...
yo: Yi ise agbese jẹ nipa...

source: Save recording
yo: Fi gbigbasilẹ

source: audio note for %s
yo: iwe akọsilẹ fun %s

source: Please wait.
yo: Jọwọ duro.

source: untitled
yo: ko si orukọ
